myrottenpotatoes/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 26], ["LIMIT", 1]]
---
  def show
    id = params[:id] # retrieve movie ID from URI route
    @movie = Movie.find_by(id: id) # look up movie by unique ID

INSERT INTO "movies" ("title", "rating", "description", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "T"], ["rating", "G"], ["description", nil], ["release_date", "2023-10-31 00:00:00"], ["created_at", "2023-10-31 01:22:13.195627"], ["updated_at", "2023-10-31 01:22:13.195627"]]
---
  def create
    if (@movie = Movie.create(movie_params))

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "movies" SET "title" = ?, "rating" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["title", "The Marvels"], ["rating", "PG"], ["updated_at", "2023-11-26 03:24:28.552910"], ["id", 26]]
---
  def update
    @movie = Movie.find params[:id]
    if (@movie.update(movie_params))