myrottenpotatoes/app/views/movies/index.html.erb

<div id="filter-options">
  <% Movie.distinct.pluck(:rating).each do |rating| %>
---
SELECT DISTINCT "movies"."rating" FROM "movies"